archieve/kEpsilonABL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (5000 0 0)
    (5000 100 0)
    (0 100 0)
    (0 0 500)
    (5000 0 500)
    (5000 100 500)
    (0 100 500)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 5 50) simpleGrading (1 1 36.2077)
);

edges
(
);

boundary
(
    Inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    Outlet
    {
        type patch;
        faces
        (
            (6 5 1 2)
        );
    }

    Ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    Top
    {
        type patch;
        faces
        (
            (5 6 7 4)
        );
    }
    Sides
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            (6 2 3 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
