archieve/kEpsilonABL/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.3868;

boundaryField
{
    Inlet
    {
        type            atmBoundaryLayerInletK;
        flowDir         (1 0 0);
        zDir            (0 0 1);
        Uref            10.0;
        Zref            6.0;
        z0              uniform 0.01;
        zGround         uniform 0.0;
        value           uniform 0.0;
    }

    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }

    Ground
    {
        type            kLowReWallFunction;
        value           uniform 1.3868;
    }

    Top
    {
        type            fixedValue;
        value           uniform 1.3868;
    }


    #include "caseDicts/setConstraintTypes"

}

// ************************************************************************* //
