archieve/kEpsilonABL/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }

    Outlet
    {
        type            calculated;
        value           uniform 0;
   }

    Ground
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.3;
        Cs              uniform 0.5;
        value           uniform 0;
    }

    Top
    {
        type            zeroGradient;
    }

    #include "caseDicts/setConstraintTypes"

}

// ************************************************************************* //
